#Бул веткада мен dict тин методтарын корсотом
#values = бул значение беру 
#keys = бул ключ кылуу
#clear = очистка
#pop = это удаляет словарь
#get = бул элемент чыгаруу
#update = это обновляет словарь

#ушул основной методтору
#Азыр мисал туру корсотом

# 📌 1. Словарь түзүү
my_dict = {'name': 'Rahma', 'age': 14, 'city': 'Bishkek'}
print("Жаңыртылган словарь:", my_dict)
# 📌 2. keys() - Баардык ачкычтарды алуу
all_keys = my_dict.keys()
print("Ачкычтар:", all_keys)
# 📌 3. values() - Баардык маанилерди алуу
all_values = my_dict.values()
print("Маанилер:", all_values)
# 📌 4. items() - Баардык ачкыч-маани түгөйлөрүн алуу (кортеж түрүндө)
all_items = my_dict.items()
print("Ачкыч-маани түгөйлөрү:", all_items)
# 📌 5. get() - Ачкычтын маанисин алуу
age = my_dict.get('age', 0)        # Бар болгон ачкыч
print("Жашы:", age)
height = my_dict.get('height', 100) # Жок ачкыч болсо, демейки маанини берет
print("Боюнун демейки мааниси:", height)

# Ушул 5 основной методтору!!!