 # Тема: Словарь (dict)
# Сөздүк (dict) ачкыч-маани жуп форматында маалыматтарды сактаган структуралардын бири,
# ал озгоруучу типке кирген маалымат!
# Биз ачкычтарды колдонуп Python сөздүк баалуулуктарына кире алабыз!

# Пустой словарь ачуу 1 методы
# 1. dict()

dict = {
    "name": "Alice",
    "age": 23,
    "city": "USA",
    "class": "Колледж",
    "Английский": "Средний+",
    "Математика": "Средний",
    "Физика": "Средний",
    "Химия": "Средний",
}
print(dict)

# Бул словарды качан например паспорт же правага окшош нерселерди тузуп жатканда ,
#  мисалы азыр дагы примерлерди корcотуп берем 


facebook = {
    'login': 'Timur',
    'email': 'Timurcrash@gmail.com',
    'password': 'offial_123',
    'number': '7+508445234',
}

print(facebook)

# Бул жакта мен например Facebook ту корсотуп бердим мына ушундай иштетилеет,
# дагы 1-2 мисал корсотуп берем.


Instagram = {
    'login': 'Alihan',
    'email': 'Alihanumka@gmail.com',
    'password': 'piton_123',
    'number': '+996506234544'
}

print(Instagram)

# Мына ушул Веткада core мен методторун корсотуп кеттим корунуздор.